versioning/service-1.1/src/test/resources/xml/goodbye-request_v1_1.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sample="urn:samples-switchyard:versioning:greeting-service:1.1">
    <soapenv:Header />
    <soapenv:Body>
        <sample:goodbye>
            <sample:name>Test</sample:name>
        </sample:goodbye>
    </soapenv:Body>
</soapenv:Envelope>
